In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [27]:
%%sql
CREATE DATABASE zomato_db;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [28]:
%%sql
USE zomato_db;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [29]:
%%sql
CREATE TABLE IF NOT EXISTS orders (
    order_id INT AUTO_INCREMENT PRIMARY KEY,
    user_id INT,
    item_id INT,
    quantity INT NOT NULL,
    delivery_address VARCHAR(255) NOT NULL,
    order_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

INSERT INTO orders (user_id, item_id, quantity, delivery_address) VALUES
(1, 1, 2, '123 Main St'),
(2, 2, 1, '456 Oak Rd'),
(3, 3, 3, '789 Pine Ave');

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
3 rows affected.

[]

In [41]:
%%sql
SELECT * FROM orders;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(1, 1, 1, 2, '123 Main St', datetime.datetime(2025, 4, 16, 22, 23, 28)),
 (2, 2, 2, 1, '456 Oak Rd', datetime.datetime(2025, 4, 16, 22, 23, 28)),
 (3, 3, 3, 3, '789 Pine Ave', datetime.datetime(2025, 4, 16, 22, 23, 28)),
 (4, 1, 3, 1, 'Coimbatore', datetime.datetime(2025, 4, 16, 22, 27, 5)),
 (5, 1, 1, 2, 'Sundarapuram', datetime.datetime(2025, 4, 16, 23, 7, 39))]

In [30]:
%%sql
CREATE TABLE IF NOT EXISTS categories (
    category_id INT AUTO_INCREMENT PRIMARY KEY,
    category_name VARCHAR(255) NOT NULL
);

INSERT INTO categories (category_name) VALUES
('Vegetarian'),
('Non-Vegetarian'),
('Vegan');

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
3 rows affected.

[]

In [31]:
%%sql
CREATE TABLE IF NOT EXISTS items (
    item_id INT AUTO_INCREMENT PRIMARY KEY,
    item_name VARCHAR(255) NOT NULL,
    price DECIMAL(10, 2) NOT NULL,
    category_id INT
);

INSERT INTO items (item_name, price, category_id) VALUES
('Biriyani', 150.00, 2),
('Masala Dosa', 100.00, 1),
('Butter Chicken', 200.00, 2);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
3 rows affected.

[]

In [32]:
%%sql
CREATE TABLE IF NOT EXISTS order_items (
    order_item_id INT AUTO_INCREMENT PRIMARY KEY,
    order_id INT,
    item_id INT,
    quantity INT NOT NULL,
    price DECIMAL(10, 2),
    FOREIGN KEY (item_id) REFERENCES items(item_id)
);

INSERT INTO order_items (order_id, item_id, quantity, price) VALUES
(1, 1, 2, 150.00),
(2, 2, 1, 100.00),
(3, 3, 3, 200.00);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
3 rows affected.

[]

In [33]:
%%sql
CREATE TABLE IF NOT EXISTS payments (
    payment_id INT AUTO_INCREMENT PRIMARY KEY,
    order_id INT,
    payment_method VARCHAR(50),
    payment_status VARCHAR(50),
    amount DECIMAL(10, 2),
    paid_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

INSERT INTO payments (order_id, payment_method, payment_status, amount) VALUES
(1, 'Credit Card', 'Paid', 300.00),
(2, 'Debit Card', 'Paid', 100.00),
(3, 'GPay', 'Pending', 600.00);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
3 rows affected.

[]

In [34]:
%%sql
CREATE TABLE IF NOT EXISTS customers (
    user_id INT PRIMARY KEY,
    first_name VARCHAR(255),
    last_name VARCHAR(255),
    phone_number VARCHAR(15),
    email VARCHAR(255)
);

INSERT INTO customers (user_id, first_name, last_name, phone_number, email) VALUES
(1, 'John', 'Doe', '123-456-7890', 'john.doe@example.com'),
(2, 'Jane', 'Smith', '987-654-3210', 'jane.smith@example.com'),
(3, 'Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com'),
(4, 'Bob', 'Brown', '444-555-6666', 'bob.brown@example.com'),
(5, 'Gowtham', 'Kumar', '777-888-9999', 'gowtham.kumar@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
5 rows affected.

[]

In [44]:
%%sql
# Total Revenue from All Orders
SELECT SUM(oi.price * oi.quantity) AS total_revenue
FROM order_items oi;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(Decimal('1000.00'),)]

In [45]:
%%sql
# Revenue by Item
SELECT i.item_name, SUM(oi.price * oi.quantity) AS total_revenue
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
GROUP BY i.item_name
ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Butter Chicken', Decimal('600.00')),
 ('Biriyani', Decimal('300.00')),
 ('Masala Dosa', Decimal('100.00'))]

In [47]:
%%sql
# Revenue by Payment Method
SELECT p.payment_method, SUM(p.amount) AS total_revenue
FROM payments p
GROUP BY p.payment_method;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Credit Card', Decimal('300.00')),
 ('Debit Card', Decimal('100.00')),
 ('GPay', Decimal('600.00'))]

In [48]:
%%sql
# Total Revenue by Date
SELECT DATE(p.paid_at) AS date, SUM(p.amount) AS daily_revenue
FROM payments p
GROUP BY DATE(p.paid_at)
ORDER BY date;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(datetime.date(2025, 4, 16), Decimal('1000.00'))]

In [51]:
%%sql
# Total Orders and Revenue by User
SELECT 
    u.first_name,
    u.last_name,
    u.phone_number,
    u.email,
    COUNT(o.order_id) AS total_orders,
    SUM(oi.price * oi.quantity) AS total_revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers u ON o.user_id = u.user_id
GROUP BY u.user_id
ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', 1, Decimal('600.00')),
 ('John', 'Doe', '123-456-7890', 'john.doe@example.com', 1, Decimal('300.00')),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', 1, Decimal('100.00'))]

In [52]:
%%sql
# Items Ordered by Category
SELECT c.category_name, i.item_name, SUM(oi.quantity) AS total_quantity_ordered
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
JOIN categories c ON i.category_id = c.category_id
GROUP BY c.category_name, i.item_name
ORDER BY total_quantity_ordered DESC;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Non-Vegetarian', 'Butter Chicken', Decimal('3')),
 ('Non-Vegetarian', 'Biriyani', Decimal('2')),
 ('Vegetarian', 'Masala Dosa', Decimal('1'))]

In [53]:
%%sql
# Orders by Payment Status
SELECT p.payment_status, COUNT(o.order_id) AS total_orders
FROM payments p
JOIN orders o ON p.order_id = o.order_id
GROUP BY p.payment_status;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[('Paid', 2), ('Pending', 1)]

In [55]:
%%sql
# Users with Most Orders
SELECT 
    u.first_name, 
    u.last_name, 
    COUNT(o.order_id) AS total_orders
FROM customers u
JOIN orders o ON u.user_id = o.user_id
GROUP BY u.user_id
ORDER BY total_orders DESC
LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('John', 'Doe', 3), ('Jane', 'Smith', 1), ('Alice', 'Johnson', 1)]

In [56]:
%%sql
# Revenue by Category
SELECT c.category_name, SUM(oi.price * oi.quantity) AS total_revenue
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
JOIN categories c ON i.category_id = c.category_id
GROUP BY c.category_name;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[('Non-Vegetarian', Decimal('900.00')), ('Vegetarian', Decimal('100.00'))]

In [57]:
%%sql
# Items Purchased in Specific Order
SELECT oi.order_id, i.item_name, oi.quantity, oi.price
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
WHERE oi.order_id = 1;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1, 'Biriyani', 2, Decimal('150.00'))]

In [59]:
%%sql
# Customer Details with Orders
SELECT 
    c.first_name, 
    c.last_name, 
    c.phone_number, 
    c.email, 
    o.order_id, 
    o.delivery_address, 
    oi.item_id, 
    oi.quantity
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers c ON o.user_id = c.user_id;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('John', 'Doe', '123-456-7890', 'john.doe@example.com', 1, '123 Main St', 1, 2),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', 2, '456 Oak Rd', 2, 1),
 ('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', 3, '789 Pine Ave', 3, 3)]

In [58]:
%%sql
# Revenue by Customer
SELECT 
    c.first_name, 
    c.last_name, 
    c.phone_number, 
    c.email, 
    SUM(oi.price * oi.quantity) AS total_revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers c ON o.user_id = c.user_id
GROUP BY c.user_id
ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', Decimal('600.00')),
 ('John', 'Doe', '123-456-7890', 'john.doe@example.com', Decimal('300.00')),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', Decimal('100.00'))]